---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.GetFile
source: html/1baac5bf-ee32-4d1c-0ba3-6193124c0d9c.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.GetFile Method

Gets the handle to the IFC file being created during this export operation.

## Syntax (C#)
```csharp
public IFCFile GetFile()
```

## Returns
The handle to the file.